app/Controllers/JadwalShift.php

    public function index()
    {
        $data['jadwal_shift'] = $this->jadwalShiftModel->findAll();
        // Get users for each jadwal shift
        foreach ($data['jadwal_shift'] as &$shift) {
            $shift['users'] = $this->userModel->where('id_jadwal_shift', $shift['id_jadwal_shift'])->findAll();
---
SELECT *
FROM `tb_jadwal_shift`
SELECT *
FROM `tb_user`
WHERE `id_jadwal_shift` = '1'

    public function create()
    {
        $data['users'] = $this->userModel->where('role', 'karyawan')->findAll();
---
SELECT *
FROM `tb_user`
WHERE `role` = 'karyawan'

    public function edit($id)
    {
        $data['jadwal_shift'] = $this->jadwalShiftModel->find($id);
        // Get users assigned to this shift
        $data['assigned_users'] = $this->userModel->where('id_jadwal_shift', $id)->findAll();
        // Get users not assigned to any shift
        $data['available_users'] = $this->userModel->where('id_jadwal_shift IS NULL')->findAll();
---
SELECT *
FROM `tb_jadwal_shift`
WHERE `tb_jadwal_shift`.`id_jadwal_shift` = '1'
SELECT *
FROM `tb_user`
WHERE `id_jadwal_shift` = '1'
SELECT *
FROM `tb_user`
WHERE `id_jadwal_shift` IS NULL