app/Controllers/Users.php

    public function index()
    {
        $data['users'] = $this->userModel->findAll();
---
SELECT *
FROM `tb_user`