app/Models/PresensiModel.php

    public function getPresensiWithUser()
    {
<<<<<<< HEAD
        return $this->select('tb_presensi.*, tb_user.nama')
            ->join('tb_user', 'tb_user.iduser = tb_presensi.tb_user_iduser')
---
SELECT `tb_presensi`.*, `tb_user`.`nama`, `tb_jadwal_shift`.`shift_mulai` as `jadwal_masuk`, `tb_jadwal_shift`.`shift_selesai` as `jadwal_pulang`
FROM `tb_presensi`
JOIN `tb_user` ON `tb_user`.`iduser` = `tb_presensi`.`tb_user_iduser`
JOIN `tb_jadwal_shift` ON `tb_jadwal_shift`.`id_jadwal_shift` = `tb_presensi`.`tb_jadwal_shift_id_jadwal_shift`