app/Models/UserModel.php

    public function verifyPassword($username, $password)
    {
        $user = $this->where('nama', $username)->first();
---
SELECT *
FROM `tb_user`
WHERE `nama` = 'wawa'
 LIMIT 1